sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/*!
    \file    gd32a7xx_fmc.h
    \brief   definitions for the FMC

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_FMC_H
#define GD32A7XX_FMC_H

#include "gd32a7xx.h"

/* FMC and option bytes definition */
#define FMC                          FMC_BASE                                           /*!< FMC register base address */
#define OB                           OB_BASE                                            /*!< HOST option bytes base address */
#define HSM_OB                       ((uint32_t)0x1FFFF880U)                            /*!< HSM option bytes base address */

/* registers definitions */
#define FMC_WS                       REG32((FMC) + 0x00000000U)                         /*!< FMC wait state register */
#define FMC_SPCKEY                   REG32((FMC) + 0x00000004U)                         /*!< FMC unlock SPC protection register */
#define FMC_KEY0                     REG32((FMC) + 0x00000014U)                         /*!< FMC unlock key register 0 */
#define FMC_STAT0                    REG32((FMC) + 0x00000018U)                         /*!< FMC status register 0 */
#define FMC_CTL0                     REG32((FMC) + 0x0000001CU)                         /*!< FMC control register 0 */
#define FMC_ADDR0                    REG32((FMC) + 0x00000020U)                         /*!< FMC address register 0 */
#define FMC_WDATL0                   REG32((FMC) + 0x00000024U)                         /*!< FMC write data register LOW 0 */
#define FMC_WDATH0                   REG32((FMC) + 0x00000028U)                         /*!< FMC write data register HIGH 0 */
#define FMC_OBSTAT                   REG32((FMC) + 0x00000030U)                         /*!< FMC option byte status register */
#define FMC_WP0                      REG32((FMC) + 0x00000034U)                         /*!< FMC erase/program protection register 0 */
#define FMC_WP1                      REG32((FMC) + 0x00000038U)                         /*!< FMC erase/program protection register 1 */
#define FMC_WP2                      REG32((FMC) + 0x0000003CU)                         /*!< FMC erase/program protection register 2 */
#define FMC_OBUSER1_0                REG32((FMC) + 0x00000040U)                         /*!< FMC option byte USER1 register 0 */
#define FMC_OBUSER1_1                REG32((FMC) + 0x00000044U)                         /*!< FMC option byte USER1 register 1 */
#define FMC_HSMOBSTAT                REG32((FMC) + 0x00000048U)                         /*!< FMC HSM option byte status register */
#define FMC_HSMWP                    REG32((FMC) + 0x0000004CU)                         /*!< FMC HSM erase/program protection register */
#define FMC_BLK0ECCCS                REG32((FMC) + 0x00000060U)                         /*!< FMC block 0 ECC control and status register */
#define FMC_BLK0UCECCADDR            REG32((FMC) + 0x00000064U)                         /*!< FMC block 0 UCECC address register */
#define FMC_BLK0CECCADDR0            REG32((FMC) + 0x00000068U)                         /*!< FMC block 0 CECC address0 register */
#define FMC_BLK0CECCADDR1            REG32((FMC) + 0x0000006CU)                         /*!< FMC block 0 CECC address1 register */
#define FMC_BLK0CECCADDR2            REG32((FMC) + 0x00000070U)                         /*!< FMC block 0 CECC address2 register */
#define FMC_BLK0CECCADDR3            REG32((FMC) + 0x00000074U)                         /*!< FMC block 0 CECC address3 register */
#define FMC_BUF0ECCCS                REG32((FMC) + 0x00000080U)                         /*!< FMC buffer 0 control register */
#define FMC_BUF0UCECCADDR            REG32((FMC) + 0x00000084U)                         /*!< FMC buffer 0 UCECC address register */
#define FMC_BUF0CECCADDR0            REG32((FMC) + 0x00000088U)                         /*!< FMC buffer 0 correct ECC address0 register */
#define FMC_BUF0CECCADDR1            REG32((FMC) + 0x0000008CU)                         /*!< FMC buffer 0 correct ECC address1 register */
#define FMC_BUF0CECCADDR2            REG32((FMC) + 0x00000090U)                         /*!< FMC buffer 0 correct ECC address2 register */
#define FMC_BUF0CECCADDR3            REG32((FMC) + 0x00000094U)                         /*!< FMC buffer 0 correct ECC address3 register */
#define FMC_FPB_ECCCS                REG32((FMC) + 0x000000A0U)                         /*!< FMC fast program buffer ECC control and status register */
#define FMC_FPB_UCECCADDR            REG32((FMC) + 0x000000A4U)                         /*!< FMC fast program buffer UCECC address register */
#define FMC_FPB_CECCADDR0            REG32((FMC) + 0x000000A8U)                         /*!< FMC fast program buffer correct ECC address0 register */
#define FMC_FPB_CECCADDR1            REG32((FMC) + 0x000000ACU)                         /*!< FMC fast program buffer correct ECC address1 register */
#define FMC_FPB_CECCADDR2            REG32((FMC) + 0x000000B0U)                         /*!< FMC fast program buffer correct ECC address2 register */
#define FMC_FPB_CECCADDR3            REG32((FMC) + 0x000000B4U)                         /*!< FMC fast program buffer correct ECC address3 register */
#define FMC_PID0                     REG32((FMC) + 0x000000D0U)                         /*!< FMC product ID register 0 */
#define FMC_PID1                     REG32((FMC) + 0x000000D4U)                         /*!< FMC product ID register 1 */
#define FMC_KEY1                     REG32((FMC) + 0x00000114U)                         /*!< FMC unlock key register 1 */
#define FMC_STAT1                    REG32((FMC) + 0x00000118U)                         /*!< FMC status register 1 */
#define FMC_CTL1                     REG32((FMC) + 0x0000011CU)                         /*!< FMC control register 1 */
#define FMC_ADDR1                    REG32((FMC) + 0x00000120U)                         /*!< FMC address register 1 */
#define FMC_WDATL1                   REG32((FMC) + 0x00000124U)                         /*!< FMC write data register LOW 1 */
#define FMC_WDATH1                   REG32((FMC) + 0x00000128U)                         /*!< FMC write data register HIGH 1 */
#define FMC_BLK1ECCCS                REG32((FMC) + 0x00000160U)                         /*!< FMC block 1 ECC control and status register */
#define FMC_BLK1UCECCADDR            REG32((FMC) + 0x00000164U)                         /*!< FMC block 1 UCECC address register */
#define FMC_BLK1CECCADDR0            REG32((FMC) + 0x00000168U)                         /*!< FMC block 1 CECC address0 register */
#define FMC_BLK1CECCADDR1            REG32((FMC) + 0x0000016CU)                         /*!< FMC block 1 CECC address1 register */
#define FMC_BLK1CECCADDR2            REG32((FMC) + 0x00000170U)                         /*!< FMC block 1 CECC address2 register */
#define FMC_BLK1CECCADDR3            REG32((FMC) + 0x00000174U)                         /*!< FMC block 1 CECC address3 register */
#define FMC_BUF1ECCCS                REG32((FMC) + 0x00000180U)                         /*!< FMC buffer 1 control register */
#define FMC_BUF1UCECCADDR            REG32((FMC) + 0x00000184U)                         /*!< FMC buffer 1 UCECC address register */
#define FMC_BUF1CECCADDR0            REG32((FMC) + 0x00000188U)                         /*!< FMC buffer 1 correct ECC address0 register */
#define FMC_BUF1CECCADDR1            REG32((FMC) + 0x0000018CU)                         /*!< FMC buffer 1 correct ECC address1 register */
#define FMC_BUF1CECCADDR2            REG32((FMC) + 0x00000190U)                         /*!< FMC buffer 1 correct ECC address2 register */
#define FMC_BUF1CECCADDR3            REG32((FMC) + 0x00000194U)                         /*!< FMC buffer 1 correct ECC address3 register */
#define FMC_BLK2ECCCS                REG32((FMC) + 0x00000260U)                         /*!< FMC block 2 ECC control and status register */
#define FMC_BLK2UCECCADDR            REG32((FMC) + 0x00000264U)                         /*!< FMC block 2 UCECC address register */
#define FMC_BLK2CECCADDR0            REG32((FMC) + 0x00000268U)                         /*!< FMC block 2 CECC address0 register */
#define FMC_BLK2CECCADDR1            REG32((FMC) + 0x0000026CU)                         /*!< FMC block 2 CECC address1 register */
#define FMC_BLK2CECCADDR2            REG32((FMC) + 0x00000270U)                         /*!< FMC block 2 CECC address2 register */
#define FMC_BLK2CECCADDR3            REG32((FMC) + 0x00000274U)                         /*!< FMC block 2 CECC address3 register */
#define FMC_BUF2ECCCS                REG32((FMC) + 0x00000280U)                         /*!< FMC buffer 2 control register */
#define FMC_BUF2UCECCADDR            REG32((FMC) + 0x00000284U)                         /*!< FMC buffer 2 UCECC address register */
#define FMC_BUF2CECCADDR0            REG32((FMC) + 0x00000288U)                         /*!< FMC buffer 2 correct ECC address0 register */
#define FMC_BUF2CECCADDR1            REG32((FMC) + 0x0000028CU)                         /*!< FMC buffer 2 correct ECC address1 register */
#define FMC_BUF2CECCADDR2            REG32((FMC) + 0x00000290U)                         /*!< FMC buffer 2 correct ECC address2 register */
#define FMC_BUF2CECCADDR3            REG32((FMC) + 0x00000294U)                         /*!< FMC buffer 2 correct ECC address3 register */
#define FMC_BLK3ECCCS                REG32((FMC) + 0x00000360U)                         /*!< FMC block 3 ECC control and status register */
#define FMC_BLK3UCECCADDR            REG32((FMC) + 0x00000364U)                         /*!< FMC block 3 UCECC address register */
#define FMC_BLK3CECCADDR0            REG32((FMC) + 0x00000368U)                         /*!< FMC block 3 CECC address0 register */
#define FMC_BLK3CECCADDR1            REG32((FMC) + 0x0000036CU)                         /*!< FMC block 3 CECC address1 register */
#define FMC_BLK3CECCADDR2            REG32((FMC) + 0x00000370U)                         /*!< FMC block 3 CECC address2 register */
#define FMC_BLK3CECCADDR3            REG32((FMC) + 0x00000374U)                         /*!< FMC block 3 CECC address3 register */
#define FMC_BUF3ECCCS                REG32((FMC) + 0x00000380U)                         /*!< FMC buffer 3 control register */
#define FMC_BUF3UCECCADDR            REG32((FMC) + 0x00000384U)                         /*!< FMC buffer 3 UCECC address register */
#define FMC_BUF3CECCADDR0            REG32((FMC) + 0x00000388U)                         /*!< FMC buffer 3 correct ECC address0 register */
#define FMC_BUF3CECCADDR1            REG32((FMC) + 0x0000038CU)                         /*!< FMC buffer 3 correct ECC address1 register */
#define FMC_BUF3CECCADDR2            REG32((FMC) + 0x00000390U)                         /*!< FMC buffer 3 correct ECC address2 register */
#define FMC_BUF3CECCADDR3            REG32((FMC) + 0x00000394U)                         /*!< FMC buffer 3 correct ECC address3 register */

#define OP_BYTE(x)                   REG32(OB + ((uint32_t)((uint32_t)0x04U * (x))))    /*!< HOST option bytes value */
#define OB_SPC                       REG16((OB) + 0x00000000U)                          /*!< HOST option bytes security protection value*/
#define OB_USER                      REG16((OB) + 0x00000002U)                          /*!< HOST option bytes user value*/
#define OB_SPC_USER                  REG32((OB) + 0x00000000U)                          /*!< HOST option bytes security protection value and user value */
#define OB_DATA                      REG32((OB) + 0x00000004U)                          /*!< HOST option bytes data value */

#define HSMOP_BYTE(x)                REG32(HSM_OB + ((uint32_t)((uint32_t)0x04U * (x))))/*!< HSM option bytes value */
#define OB_HSMUSER                   REG16((HSM_OB) + 0x00000000U)                      /*!< HSM option bytes user value*/
#define OB_HSMSPC                    REG16((HSM_OB) + 0x00000002U)                      /*!< HSM option bytes security protection value*/

