sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* bits definitions */
/* FMC_WS */
#define FMC_WS_WSCNT                 BITS(0,2)                                          /*!< wait state counter */

/* FMC_SPCKEY */
#define FMC_SPCKEY_SPCKEY            BITS(0,31)                                         /*!< SPC protection unlock key */

/* FMC_KEY0 */
#define FMC_KEY0_KEY                 BITS(0,31)                                         /*!< FMC control register 0 unlock key bits */

/* FMC_STAT0 */
#define FMC_STAT0_BUSY               BIT(0)                                             /*!< busy flag in stat0 register */
#define FMC_STAT0_PGSERR             BIT(1)                                             /*!< program sequence error flag in stat0 register */
#define FMC_STAT0_PGERR              BIT(2)                                             /*!< program error flag in stat0 register in stat0 register */
#define FMC_STAT0_WPERR              BIT(4)                                             /*!< erase/program protection error flag in stat0 register */
#define FMC_STAT0_ENDF               BIT(5)                                             /*!< end of operation flag in stat0 register */
#define FMC_STAT0_CBCMDERR           BIT(6)                                             /*!< checked area by the check blank command is all 0xFF or not in stat0 register */
#define FMC_STAT0_LOADECCERR         BIT(12)                                            /*!< uncorrected ECC error when load in stat0 register */
#define FMC_STAT0_COMPERR            BIT(13)                                            /*!< complement error in writing data flag in stat0 register */
#define FMC_STAT0_TMRERR             BIT(14)                                            /*!< TMR error flag bit in stat0 register */
#define FMC_STAT0_RSTERR             BIT(15)                                            /*!< POR or system reset error during erase/program flag in stat0 register */

/* FMC_CTL0 */
#define FMC_CTL0_PG                  BIT(0)                                             /*!< program command bit in ctl0 register */
#define FMC_CTL0_PER                 BIT(1)                                             /*!< page erase command bit in ctl0 register */
#define FMC_CTL0_MER                 BIT(2)                                             /*!< mass erase command bit in ctl0 register */
#define FMC_CTL0_START               BIT(6)                                             /*!< send command to FMC bit in ctl0 register */
#define FMC_CTL0_LK                  BIT(7)                                             /*!< lock bit of FMC_CTL0 register in ctl0 register */
#define FMC_CTL0_FSTPG               BIT(8)                                             /*!< fast program command bit in ctl0 register */
#define FMC_CTL0_ERRIE               BIT(10)                                            /*!< error interrupt enable bit in ctl0 register */
#define FMC_CTL0_ENDIE               BIT(12)                                            /*!< end of operation interrupt enable bit in ctl0 register */
#define FMC_CTL0_OBRLD               BIT(13)                                            /*!< option bytes reload bit in ctl0 register */
#define FMC_CTL0_CBCMD               BIT(16)                                            /*!< send check blank command in ctl0 register */
#define FMC_CTL0_MASTERID            BITS(20,23)                                        /*!< the Master ID of unlock FMC_CTL0 register in ctl0 register */
#define FMC_CTL0_CBCMDLEN            BITS(29,31)                                        /*!< check blank command read length in ctl0 register */

/* FMC_ADDR0 */
#define FMC_ADDR0_ADDR               BITS(0,31)                                         /*!< flash erase/program command address bits */

/* FMC_WDATL0 */
#define FMC_WDATL0_WDATA             BITS(0,31)                                         /*!< flash program command write data bits in write data low 0 register */

/* FMC_WDATH0 */
#define FMC_WDATH0_WDATA             BITS(0,31)                                         /*!< flash program command write data bits in write data high 0 register */

/* FMC_OBSTAT */
#define FMC_OBSTAT_OBERR             BIT(0)                                             /*!< HOST option bytes read error bit */
#define FMC_OBSTAT_PLEVEL            BITS(1,2)                                          /*!< HOST security protection level bits */
#define FMC_OBSTAT_SPCS              BIT(3)                                             /*!< HOST security protection state bits */
#define FMC_OBSTAT_nFWDG0_HW         BIT(8)                                             /*!< Free watchdog 0 mode configuration bit */
#define FMC_OBSTAT_nRST_STDBY        BIT(10)                                            /*!< Reset mode configuration bit when entering standby mode */
#define FMC_OBSTAT_nFWDG1_HW         BIT(13)                                            /*!< Free watchdog 1 mode configuration bit */
#define FMC_OBSTAT_nFWDG_STDBY       BIT(14)                                            /*!< Free watchdog count mode configuration bit in standby mode */
#define FMC_OBSTAT_DATA              BITS(16,31)                                        /*!< HOST option bytes data bits */

/* FMC_WP0 */
#define FMC_WP0_BK0WP                BITS(0,31)                                         /*!< store OB_BK0WP[31:0] of HOST option bytes block after system reset */

/* FMC_WP1 */
#define FMC_WP1_BK1WP                BITS(0,31)                                         /*!< store OB_BK1WP[31:0] of HOST option bytes block after system reset */

/* FMC_WP2 */
#define FMC_WP2_DFWP                 BITS(0,7)                                          /*!< store OB_DFWP[7:0] of HOST option bytes block after system reset */

/* FMC_OBUSER1_0 */
#define FMC_OBUSER1_0_USER1          BITS(0,31)                                         /*!< store OB_USER1[31:0] of HOST option bytes block after system reset */

/* FMC_OBUSER1_1 */
#define FMC_OBUSER1_1_USER1          BITS(0,31)                                         /*!< store OB_USER1[63:32] of HOST option bytes block after system reset */

/* FMC_HSMOBSTAT */
#define FMC_HSMOBSTAT_OBERR          BIT(0)                                             /*!< HSM option byte read error bit */
#define FMC_HSMOBSTAT_HSMSPCSET      BIT(1)                                             /*!< HSM security protection set bit */
#define FMC_HSMOBSTAT_HSMSPCS        BIT(2)                                             /*!< HSM security protection state */
#define FMC_HSMOBSTAT_USER           BITS(16,21)                                        /*!< Store OB_HSMUSER[5:0] of HSM option byte block after system reset */
#define FMC_HSMOBSTAT_HSM_nWWDG_HW   BIT(22)                                            /*!< HSM window watch dog mode configuration bit */
#define FMC_HSMOBSTAT_SWAP           BIT(23)                                            /*!< bank swap */
#define FMC_HSMOBSTAT_SPC            BITS(24,31)                                        /*!< HSM option byte security protection code */

/* FMC_HSMWP */
#define FMC_HSMWP_HSMPFWP            BITS(0,7)                                          /*!< store OB_HSMPFWP[7:0] of HSM option bytes block after system reset */
#define FMC_HSMWP_HSMDFWP            BITS(8,15)                                         /*!< store OB_HSMDFWP[7:0] of HSM option bytes block after system reset */
#define FMC_HSMWP_HSMSIZE            BITS(16,20)                                        /*!< HSM bank 0 / bank 1 size */
#define FMC_HSMWP_HSMSEC             BIT(23)                                            /*!< HSM security */
#define FMC_HSMWP_HSMEN              BIT(29)                                            /*!< HSM enable */
#define FMC_HSMWP_HOSTSIZE           BITS(30,31)                                        /*!< HOST bank 0 / bank 1 size */

/* FMC_BLKECCCS */
#define FMC_BLKECCCS_ECCCOR0         BIT(16)                                            /*!< block one bit error detected and correct flag 0 */
#define FMC_BLKECCCS_ECCCOR1         BIT(17)                                            /*!< block one bit error detected and correct flag 1 */
#define FMC_BLKECCCS_ECCCOR2         BIT(18)                                            /*!< block one bit error detected and correct flag 2 */
#define FMC_BLKECCCS_ECCCOR3         BIT(19)                                            /*!< block one bit error detected and correct flag 3 */
#define FMC_BLKECCCS_ECCCORC         BIT(20)                                            /*!< write 1 to clear ECCORx (x = 0, 1, 2, 3) */
#define FMC_BLKECCCS_ECCCORIE        BIT(24)                                            /*!< block one bit error correct interrupt enable */
#define FMC_BLKECCCS_ECCDETIE        BIT(25)                                            /*!< block two bit errors detect / EDC error / address ECC error interrupt enable */
#define FMC_BLKECCCS_ECCCOROVIE      BIT(26)                                            /*!< block more than 4 one bit error detect interrupt enable */
#define FMC_BLKECCCS_ECCAERR         BIT(28)                                            /*!< block one bit ECC error in address stage */
#define FMC_BLKECCCS_ECCCOROV        BIT(29)                                            /*!< block more than 4 one bit error flag */
#define FMC_BLKECCCS_ECCEDC          BIT(30)                                            /*!< block EDC after ECC checker error flag */
#define FMC_BLKECCCS_ECCDET          BIT(31)                                            /*!< block two bits error detect flag */

/* FMC_BLKUCECCADDR */
#define FMC_BLKUCECCADDR_ECCADDR     BITS(0,21)                                         /*!< the offset address of double word where an uncorrectable ECC error in block x is detected (x = 0, 1, 2, 3) */

/* FMC_BLKCECCADDR0 */
#define FMC_BLKCECCADDR0_ECCADDR     BITS(0,21)                                         /*!< the offset address of double word where an correctable ECC error 0 in block x is detected (x = 0, 1, 2, 3) */

