sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* FMC_BLKCECCADDR1 */
#define FMC_BLKCECCADDR1_ECCADDR     BITS(0,21)                                         /*!< the offset address of double word where an correctable ECC error 1 in block x is detected (x = 0, 1, 2, 3) */

/* FMC_BLKCECCADDR2 */
#define FMC_BLKCECCADDR2_ECCADDR     BITS(0,21)                                         /*!< the offset address of double word where an correctable ECC error 2 in block x is detected (x = 0, 1, 2, 3) */

/* FMC_BLKCECCADDR3 */
#define FMC_BLKCECCADDR3_ECCADDR     BITS(0,21)                                         /*!< the offset address of double word where an correctable ECC error 3 in block x is detected (x = 0, 1, 2, 3) */

/* FMC_BUFECCCS */
#define FMC_BUFECCCS_CBUFEN          BIT(0)                                             /*!< read code buffers enable bit */
#define FMC_BUFECCCS_DBUFEN          BIT(1)                                             /*!< read data buffers enable bit */
#define FMC_BUFECCCS_CPFEN           BIT(2)                                             /*!< code prefetch enable */
#define FMC_BUFECCCS_DPFEN           BIT(3)                                             /*!< data prefetch enable */
#define FMC_BUFECCCS_BUFEN           BIT(4)                                             /*!< buffers enable */
#define FMC_BUFECCCS_ECCCOR0         BIT(16)                                            /*!< buffer one bit error detected and correct flag 0 */
#define FMC_BUFECCCS_ECCCOR1         BIT(17)                                            /*!< buffer one bit error detected and correct flag 1 */
#define FMC_BUFECCCS_ECCCOR2         BIT(18)                                            /*!< buffer one bit error detected and correct flag 2 */
#define FMC_BUFECCCS_ECCCOR3         BIT(19)                                            /*!< buffer one bit error detected and correct flag 3 */
#define FMC_BUFECCCS_ECCCORC         BIT(20)                                            /*!< write 1 to clear ECCORx (x = 0, 1, 2, 3)*/
#define FMC_BUFECCCS_ECCCORIE        BIT(24)                                            /*!< buffer one bit error correct interrupt enable */
#define FMC_BUFECCCS_ECCDETIE        BIT(25)                                            /*!< buffer two bit errors detect / EDC error / address ECC error interrupt enable */
#define FMC_BUFECCCS_ECCCOROVIE      BIT(26)                                            /*!< buffer more than 4 one bit error detect interrupt enable */
#define FMC_BUFECCCS_ECCAERR         BIT(28)                                            /*!< buffer one bit ECC error in address stage */
#define FMC_BUFECCCS_ECCCOROV        BIT(29)                                            /*!< buffer more than 4 one bit error detected */
#define FMC_BUFECCCS_ECCEDC          BIT(30)                                            /*!< buffer EDC after ECC checker error flag */
#define FMC_BUFECCCS_ECCDET          BIT(31)                                            /*!< buffer two bits error detect flag */

/* FMC_BUFUCECCADDR */
#define FMC_BUFUCECCADDR_ECCADDR     BITS(0,23)                                         /*!< the offset address of double word where an uncorrectable ECC error in buffer x is detected (x = 0, 1, 2, 3) */

/* FMC_BUFCECCADDR0 */
#define FMC_BUFCECCADDR0_ECCADDR     BITS(0,23)                                         /*!< the offset address of double word where an correctable ECC error 0 in buffer x is detected (x = 0, 1, 2, 3) */

/* FMC_BUFCECCADDR1 */
#define FMC_BUFCECCADDR1_ECCADDR     BITS(0,23)                                         /*!< the offset address of double word where an correctable ECC error 1 in buffer x is detected (x = 0, 1, 2, 3) */

/* FMC_BUFCECCADDR2 */
#define FMC_BUFCECCADDR2_ECCADDR     BITS(0,23)                                         /*!< the offset address of double word where an correctable ECC error 2 in buffer x is detected (x = 0, 1, 2, 3) */

/* FMC_BUFCECCADDR3 */
#define FMC_BUFCECCADDR3_ECCADDR     BITS(0,23)                                         /*!< the offset address of double word where an correctable ECC error 3 in buffer x is detected (x = 0, 1, 2, 3) */

/* FMC_FPBECCCS */
#define FMC_FPBECCCS_ECCCOR0         BIT(16)                                            /*!< fast program buffer one bit error detected and correct flag 0 */
#define FMC_FPBECCCS_ECCCOR1         BIT(17)                                            /*!< fast program buffer one bit error detected and correct flag 1 */
#define FMC_FPBECCCS_ECCCOR2         BIT(18)                                            /*!< fast program buffer one bit error detected and correct flag 2 */
#define FMC_FPBECCCS_ECCCOR3         BIT(19)                                            /*!< fast program buffer one bit error detected and correct flag 3 */
#define FMC_FPBECCCS_ECCCORC         BIT(20)                                            /*!< write 1 to clear ECCORx (x = 0,1,2,3) */
#define FMC_FPBECCCS_ECCCORIE        BIT(24)                                            /*!< fast program buffer one bit error correct interrupt enable */
#define FMC_FPBECCCS_ECCDETIE        BIT(25)                                            /*!< fast program buffer two bit errors detect / EDC error / address ECC error interrupt enable */
#define FMC_FPBECCCS_ECCCOROVIE      BIT(26)                                            /*!< fast program buffer more than 4 one bit error detect interrupt enable */
#define FMC_FPBECCCS_ECCAERR         BIT(28)                                            /*!< fast program buffer one bit ECC error in address stage */
#define FMC_FPBECCCS_ECCCOROV        BIT(29)                                            /*!< fast program buffer more than 4 one bit error detected */
#define FMC_FPBECCCS_ECCEDC          BIT(30)                                            /*!< fast program buffer EDC after ECC checker error flag */
#define FMC_FPBECCCS_ECCDET          BIT(31)                                            /*!< fast program buffer two bits error detect flag */

/* FMC_FPB_UCECCADDR */
#define FMC_FPB_UCECCADDR_ECCADDR    BITS(0,9)                                          /*!< the offset address of double word where an uncorrectable ECC error in fast program buffer is detected */

/* FMC_FPB_CECCADDR0 */
#define FMC_FPB_CECCADDR0_ECCADDR    BITS(0,9)                                          /*!< the offset address of double word where an correctable ECC error 0 in fast program buffer is detected */

