sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* FMC_FPB_CECCADDR1 */
#define FMC_FPB_CECCADDR1_ECCADDR    BITS(0,9)                                          /*!< the offset address of double word where an correctable ECC error 1 in fast program buffer is detected */

/* FMC_FPB_CECCADDR2 */
#define FMC_FPB_CECCADDR2_ECCADDR    BITS(0,9)                                          /*!< the offset address of double word where an correctable ECC error 2 in fast program buffer is detected */

/* FMC_FPB_CECCADDR3 */
#define FMC_FPB_CECCADDR3_ECCADDR    BITS(0,9)                                          /*!< the offset address of double word where an correctable ECC error 3 in fast program buffer is detected */

/* FMC_PID0 */
#define FMC_PID0_PID                 BITS(0,31)                                         /*!< Product reserved ID code register 0 */

/* FMC_PID1 */
#define FMC_PID1_PID                 BITS(0,31)                                         /*!< Product reserved ID code register 1 */

/* FMC_STAT1 */
#define FMC_STAT1_BUSY               BIT(0)                                             /*!< busy flag in stat1 register */
#define FMC_STAT1_PGSERR             BIT(1)                                             /*!< program sequence error flag in stat1 register */
#define FMC_STAT1_PGERR              BIT(2)                                             /*!< program error flag in stat1 register */
#define FMC_STAT1_WPERR              BIT(4)                                             /*!< erase/program protection error flag in stat1 register */
#define FMC_STAT1_ENDF               BIT(5)                                             /*!< end of operation flag in stat1 register */
#define FMC_STAT1_CBCMDERR           BIT(6)                                             /*!< checked area by the check blank command is all 0xFF or not in stat1 register */
#define FMC_STAT1_TMRERR             BIT(14)                                            /*!< TMR error flag bit in stat1 register */
#define FMC_STAT1_RSTERR             BIT(15)                                            /*!< POR or system reset during erase/program flag in stat1 register */

/* FMC_CTL1 */
#define FMC_CTL1_PG                  BIT(0)                                             /*!< program command bit in ctl1 register */
#define FMC_CTL1_PER                 BIT(1)                                             /*!< page erase command bit in ctl1 register */
#define FMC_CTL1_START               BIT(6)                                             /*!< send command to FMC bit in ctl1 register */
#define FMC_CTL1_LK                  BIT(7)                                             /*!< lock bit in ctl1 register */
#define FMC_CTL1_FSTPG               BIT(8)                                             /*!< fast program command bit in ctl1 register */
#define FMC_CTL1_ERRIE               BIT(10)                                            /*!< error interrupt enable bit in ctl1 register */
#define FMC_CTL1_ENDIE               BIT(12)                                            /*!< end of operation interrupt enable bit in ctl1 register */
#define FMC_CTL1_CBCMD               BIT(16)                                            /*!< option bytes reload bit in ctl1 register */
#define FMC_CTL1_MASTERID            BITS(20,22)                                        /*!< the Master ID of unlock FMC_CTL1 register in ctl1 register */
#define FMC_CTL1_CBCMDLEN            BITS(29,31)                                        /*!< check blank command read length in ctl1 register */

/* FMC_ADDR1 */
#define FMC_ADDR1_ADDR               BITS(0,31)                                         /*!< flash bank1 command address bits */

/* FMC_WDATL1 */
#define FMC_WDATL1_WDATA             BITS(0,31)                                         /*!< flash program command write data bits in write data low 1 register */

/* FMC_WDATH1 */
#define FMC_WDATH1_WDATA             BITS(0,31)                                         /*!< flash program command write data bits in write data high 1 register */

/* constants definitions */
/* FMC hsm option bytes initialize struct */
typedef struct {
    union {
        struct {
            uint8_t   hsmuser: 6;                                                       /*!< hsm option bytes hsmuser sub fields */
            uint8_t   hsm_nwwdg_hw: 1;                                                  /*!< hsm option bytes nwwdg_hw fields */
            uint8_t   bswap: 1;                                                         /*!< hsm option bytes bswap fields */
        }  hsmuser_struct;
        uint8_t hsm_user;
    } ob_hsmuser;                                                                       /*!< hsm option bytes hsmuser fields */
    uint8_t ob_hsmspc;                                                                  /*!< hsm option bytes hsmspc fields */
    uint8_t ob_hsmpfwp;                                                                 /*!< hsm option bytes hsmpfwp fields */
    uint8_t ob_hsmdfwp;                                                                 /*!< hsm option bytes hsmdfwp fields */
} fmc_hsm_opt_parameter_struct;

/* FMC state */
typedef enum {
    FMC_READY,                                                                          /*!< the operation has been completed */
    FMC_BUSY,                                                                           /*!< the operation is in progress */
    FMC_PGSERR,                                                                         /*!< program sequence error */
    FMC_PGERR,                                                                          /*!< program error */
    FMC_WPERR,                                                                          /*!< erase/program protection error */
    FMC_CBCMDERR,                                                                       /*!< the checked area not blank error */
    FMC_LOADECCERR,                                                                     /*!< uncorrected ECC error when load HOST OPT / HSM OPT / HSM OTP */
    FMC_COMPERR,                                                                        /*!< complement error in writing data */
    FMC_TMRERR,                                                                         /*!< TMR error */
    FMC_RSTERR,                                                                         /*!< POR or system reset during flash erase/program error */
    FMC_TOERR,                                                                          /*!< timeout error */
    FMC_OB_HSPC,                                                                        /*!< FMC HOST is under high security protection */
    FMC_HSMOB_HSPC                                                                      /*!< FMC HSM is under high security protection */
} fmc_state_enum;

