sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* FMC control interface 0 area */
typedef enum {
    BANK0_AREA = 0,                                                                     /*!< main flash bank0 area */
    BANK1_AREA,                                                                         /*!< main flash bank1 area */
    DATA_FLASH_AREA,                                                                    /*!< HOST data area */
    HSM_BANK_AREA,                                                                      /*!< HSM bank area */
    HSM_DATA_AREA                                                                       /*!< HSM data flash area */
} fmc_area_enum;

/* FMC register number */
typedef enum {
    FMC_REG_0 = 0,                                                                      /*!< FMC block0, buffer0 or fast program buffer register */
    FMC_REG_1 = 1,                                                                      /*!< FMC block1 or buffer1 register */
    FMC_REG_2 = 2,                                                                      /*!< FMC block2 or buffer2 register */
    FMC_REG_3 = 3                                                                       /*!< FMC block3 or buffer3 register */
} fmc_register_enum;

/* FMC buffer number */
typedef enum {
    FMC_BUFF_0 = 0,                                                                     /*!< FMC buffer 0 */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
    FMC_BUFF_1 = 1,                                                                     /*!< FMC buffer 1 (Only applicable to GD32A72XX / GD32A74XX) */
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
    FMC_BUFF_2 = 2,                                                                     /*!< FMC buffer 2 */
    FMC_BUFF_3 = 3                                                                      /*!< FMC buffer 3 */
} fmc_buff_enum;

/* FMC correctable ECC address */
typedef enum {
    CECC_ADDR0 = 0,                                                                     /*!< FMC correctable ECC address 0 */
    CECC_ADDR1 = 1,                                                                     /*!< FMC correctable ECC address 1 */
    CECC_ADDR2 = 2,                                                                     /*!< FMC correctable ECC address 2 */
    CECC_ADDR3 = 3                                                                      /*!< FMC correctable ECC address 3 */
} fmc_cecc_addr_enum;

/* define the FMC bit position and its register index offset */
#define FMC_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos))
#define FMC_REG_VAL(offset)             (REG32(FMC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6U)))
#define FMC_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define FMC_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22U) | (uint32_t)((bitpos2) << 16U)\
                                                             | (((uint32_t)(regidx) << 6U) | (uint32_t)(bitpos)))
#define FMC_REG_VAL2(offset)            (REG32(FMC + ((uint32_t)(offset) >> 22U)))
#define FMC_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16U)

#define FMC_REG_VAL3(offset, macro)     (REG32(FMC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6U) + 0x100U * (uint32_t)(macro)))
#define FMC_REG_VAL4(offset, macro)     (REG32(FMC + ((uint32_t)(offset) >> 22U) + 0x100U * (uint32_t)(macro)))

/* register offset */
#define FMC_STAT0_REG_OFFSET            ((uint32_t)0x00000018U)                         /*!< STAT0 register offset */
#define FMC_STAT1_REG_OFFSET            ((uint32_t)0x00000118U)                         /*!< STAT1 register offset */
#define FMC_CTL0_REG_OFFSET             ((uint32_t)0x0000001CU)                         /*!< CTL0 register offset */
#define FMC_CTL1_REG_OFFSET             ((uint32_t)0x0000011CU)                         /*!< CTL1 register offset */
#define FMC_OBSTAT_REG_OFFSET           ((uint32_t)0x00000030U)                         /*!< OBSTAT register offset */
#define FMC_HSMOBSTAT_REG_OFFSET        ((uint32_t)0x00000048U)                         /*!< HSMOBSTAT register offset */
#define FMC_BLKECCCS_REG_OFFSET         ((uint32_t)0x00000060U)                         /*!< BLKxECCCS register offset */
#define FMC_BUFECCCS_REG_OFFSET         ((uint32_t)0x00000080U)                         /*!< BUFxECCCS register offset */
#define FMC_FPBECCCS_REG_OFFSET         ((uint32_t)0x000000A0U)                         /*!< FPBxECCCS register offset */

/* FMC flags */
typedef enum {
    /* flags in STAT0 register */
    FMC_STAT0_FLAG_BUSY       = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 0U),              /*!< busy flag in stat0 register */
    FMC_STAT0_FLAG_PGSERR     = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 1U),              /*!< program sequence error flag in stat0 register */
    FMC_STAT0_FLAG_PGERR      = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 2U),              /*!< program error flag in stat0 register */
    FMC_STAT0_FLAG_WPERR      = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 4U),              /*!< erase/program protection error flag in stat0 register */
    FMC_STAT0_FLAG_END        = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 5U),              /*!< end of operation flag in stat0 register */
    FMC_STAT0_FLAG_CBCMDERR   = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 6U),              /*!< checked area by the check blank command is all 0xFF or not flag in stat0 register */
    FMC_STAT0_FLAG_LOADECCERR = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 12U),             /*!< uncorrected ECC error when load flag in stat0 register */
    FMC_STAT0_FLAG_COMPERR    = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 13U),             /*!< complement error flag in stat0 register */
    FMC_STAT0_FLAG_TMRERR     = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 14U),             /*!< TMR error flag in stat0 register */
    FMC_STAT0_FLAG_RSTERR     = FMC_REGIDX_BIT(FMC_STAT0_REG_OFFSET, 15U),             /*!< POR or system reset during erase/program flag in stat0 register */
    /* flags in STAT1 register */
    FMC_STAT1_FLAG_BUSY       = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 0U),              /*!< busy flag in stat1 register */
    FMC_STAT1_FLAG_PGSERR     = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 1U),              /*!< program sequence error flag in stat1 register */
    FMC_STAT1_FLAG_PGERR      = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 2U),              /*!< program error flag in stat1 register */
    FMC_STAT1_FLAG_WPERR      = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 4U),              /*!< erase/program protection error flag in stat1 register */
    FMC_STAT1_FLAG_END        = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 5U),              /*!< end of operation flag in stat1 register */
    FMC_STAT1_FLAG_CBCMDERR   = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 6U),              /*!< checked area by the check blank command is all 0xFF or not flag in stat1 register */
    FMC_STAT1_FLAG_TMRERR     = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 14U),             /*!< TMR error flag in stat1 register */
    FMC_STAT1_FLAG_RSTERR     = FMC_REGIDX_BIT(FMC_STAT1_REG_OFFSET, 15U),             /*!< POR or system reset during erase/program flag in stat1 register */
    /* flags in OBSTAT register */
    FMC_FLAG_OBERR            = FMC_REGIDX_BIT(FMC_OBSTAT_REG_OFFSET, 0U),             /*!< HOST option bytes error flag */
    /* flags in HSMOBSTAT register */
    FMC_FLAG_HSMOBERR         = FMC_REGIDX_BIT(FMC_HSMOBSTAT_REG_OFFSET, 0U)           /*!< HSM option bytes read error flag */
} fmc_flag_enum;

