sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* FMC interrupt flags */
typedef enum {
    /* interrupt flags in STAT0 register */
    FMC_STAT0_INT_FLAG_PGSERR   = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 1U),        /*!< program sequence error interrupt flag in stat0 register */
    FMC_STAT0_INT_FLAG_PGERR    = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 2U),        /*!< program error interrupt flag in stat0 register */
    FMC_STAT0_INT_FLAG_WPERR    = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 4U),        /*!< erase/program protection error interrupt flag in stat0 register */
    FMC_STAT0_INT_FLAG_END      = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 12U, FMC_STAT0_REG_OFFSET, 5U),        /*!< end of operation interrupt flag in stat0 register */
    FMC_STAT0_INT_FLAG_CBCMDERR = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 6U),        /*!< checked area by the check blank command is all 0xFF or not interrupt flag in stat0 register */
    FMC_STAT0_INT_FLAG_COMPERR  = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 13U),       /*!< complement error flag in stat0 register */
    FMC_STAT0_INT_FLAG_TMRERR   = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 14U),       /*!< TMR error flag in stat0 register */
    FMC_STAT0_INT_FLAG_RSTERR   = FMC_REGIDX_BIT2(FMC_CTL0_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 15U),       /*!< POR or system reset during erase/program interrupt flag in stat0 register */
    /* interrupt flags in STAT1 register */
    FMC_STAT1_INT_FLAG_PGSERR   = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 1U),        /*!< program sequence error interrupt flag in stat1 register */
    FMC_STAT1_INT_FLAG_PGERR    = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 2U),        /*!< program error interrupt flag in stat1 register */
    FMC_STAT1_INT_FLAG_WPERR    = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 4U),        /*!< erase/program protection error interrupt flag in stat1 register */
    FMC_STAT1_INT_FLAG_END      = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 12U, FMC_STAT0_REG_OFFSET, 5U),        /*!< end of operation interrupt flag in stat1 register */
    FMC_STAT1_INT_FLAG_CBCMDERR = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 6U),        /*!< checked area by the check blank command is all 0xFF or not interrupt flag in stat1 register */
    FMC_STAT1_INT_FLAG_TMRERR   = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 14U),       /*!< TMR error flag in stat1 register */
    FMC_STAT1_INT_FLAG_RSTERR   = FMC_REGIDX_BIT2(FMC_CTL1_REG_OFFSET, 10U, FMC_STAT0_REG_OFFSET, 15U)        /*!< POR or system reset during erase/program interrupt flag in stat1 register */
} fmc_interrupt_flag_enum;

/* FMC interrupt */
typedef enum {
    /* interrupt in CTL0 register */
    FMC_CTL0_INT_ERR = FMC_REGIDX_BIT(FMC_CTL0_REG_OFFSET, 10U),                        /*!< error interrupt in ctl0 register */
    FMC_CTL0_INT_END = FMC_REGIDX_BIT(FMC_CTL0_REG_OFFSET, 12U),                        /*!< end of operation interrupt in ctl0 register */
    /* interrupt in CTL1 register */
    FMC_CTL1_INT_ERR = FMC_REGIDX_BIT(FMC_CTL1_REG_OFFSET, 10U),                        /*!< error interrupt in ctl0 register */
    FMC_CTL1_INT_END = FMC_REGIDX_BIT(FMC_CTL1_REG_OFFSET, 12U)                         /*!< end of operation interrupt in ctl0 register */
} fmc_interrupt_enum;

/* FMC ECC flags */
typedef enum {
    /* flags in BLKxECCCS register */
    FMC_BLKFLAG_ECCCOR0  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 16U),                /*!< block one bit error detected and correct flag 0 */
    FMC_BLKFLAG_ECCCOR1  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 17U),                /*!< block one bit error detected and correct flag 1 */
    FMC_BLKFLAG_ECCCOR2  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 18U),                /*!< block one bit error detected and correct flag 2 */
    FMC_BLKFLAG_ECCCOR3  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 19U),                /*!< block one bit error detected and correct flag 3 */
    FMC_BLKFLAG_ECCAERR  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 28U),                /*!< block one bit error flag at ECC address */
    FMC_BLKFLAG_ECCCOROV = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 29U),                /*!< block more than 4 one bit error detected */
    FMC_BLKFLAG_ECCEDC   = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 30U),                /*!< block EDC after ECC checker error flag */
    FMC_BLKFLAG_ECCDET   = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 31U),                /*!< block two bit errors detect flag */
    /* flags in BUFxECCCS register */
    FMC_BUFFLAG_ECCCOR0  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 16U),                /*!< buffer one bit error detected and correct flag 0 */
    FMC_BUFFLAG_ECCCOR1  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 17U),                /*!< buffer one bit error detected and correct flag 1 */
    FMC_BUFFLAG_ECCCOR2  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 18U),                /*!< buffer one bit error detected and correct flag 2 */
    FMC_BUFFLAG_ECCCOR3  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 19U),                /*!< buffer one bit error detected and correct flag 3 */
    FMC_BUFFLAG_ECCAERR  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 28U),                /*!< buffer one bit error flag at ECC address */
    FMC_BUFFLAG_ECCCOROV = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 29U),                /*!< buffer more than 4 one bit error detected */
    FMC_BUFFLAG_ECCEDC   = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 30U),                /*!< buffer EDC after ECC checker error flag */
    FMC_BUFFLAG_ECCDET   = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 31U),                /*!< buffer two bit errors detect flag */
    /* flags in FPB_ECCCS register */
    FMC_FPBFLAG_ECCCOR0  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 16U),                /*!< fast program buffer one bit error detected and correct flag 0 */
    FMC_FPBFLAG_ECCCOR1  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 17U),                /*!< fast program buffer one bit error detected and correct flag 1 */
    FMC_FPBFLAG_ECCCOR2  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 18U),                /*!< fast program buffer one bit error detected and correct flag 2 */
    FMC_FPBFLAG_ECCCOR3  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 19U),                /*!< fast program buffer one bit error detected and correct flag 3 */
    FMC_FPBFLAG_ECCAERR  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 28U),                /*!< fast program buffer ECC address one bit error flag */
    FMC_FPBFLAG_ECCCOROV = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 29U),                /*!< fast program buffer more than 4 one bit error detected */
    FMC_FPBFLAG_ECCEDC   = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 30U),                /*!< fast program buffer EDC after ECC checker error flag */
    FMC_FPBFLAG_ECCDET   = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 31U)                 /*!< fast program buffer two bit errors detect flag */
} fmc_ecc_flag_enum;

/* FMC ECC interrupt */
typedef enum {
    /* interrupt in BLKxECCCS register */
    FMC_BLK_INT_ECCCOR  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 24U),                  /*!< block one bit error correct interrupt */
    FMC_BLK_INT_ECCDET  = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 25U),                  /*!< block two bits error interrupt */
    FMC_BLK_INT_ECCCORV = FMC_REGIDX_BIT(FMC_BLKECCCS_REG_OFFSET, 26U),                  /*!< block more than 4 one bit error detect interrupt */
    /* interrupt in BUFxECCCS register */
    FMC_BUF_INT_ECCCOR  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 24U),                  /*!< buffer one bit error correct interrupt */
    FMC_BUF_INT_ECCDET  = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 25U),                  /*!< buffer two bits error interrupt */
    FMC_BUF_INT_ECCCORV = FMC_REGIDX_BIT(FMC_BUFECCCS_REG_OFFSET, 26U),                  /*!< buffer more than 4 one bit error detect interrupt */
    /* interrupt in FPB_ECCCS register */
    FMC_FPB_INT_ECCCOR  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 24U),                  /*!< fast program buffer one bit error correct interrupt */
    FMC_FPB_INT_ECCDET  = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 25U),                  /*!< fast program buffer two bits error interrupt */
    FMC_FPB_INT_ECCCORV = FMC_REGIDX_BIT(FMC_FPBECCCS_REG_OFFSET, 26U),                  /*!< fast program buffer more than 4 one bit error detect interrupt */
} fmc_ecc_interrupt_enum;

/* FMC ECC interrupt flags */
typedef enum {
    /* interrupt flags in BLKECCCS register */
    FMC_BLK_INT_FLAG_ECCCOR0  = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 24U, FMC_BLKECCCS_REG_OFFSET, 16U),      /*!< block one bit error detected and correct interrupt flag 0 */
    FMC_BLK_INT_FLAG_ECCCOR1  = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 24U, FMC_BLKECCCS_REG_OFFSET, 17U),      /*!< block one bit error detected and correct interrupt flag 1 */
    FMC_BLK_INT_FLAG_ECCCOR2  = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 24U, FMC_BLKECCCS_REG_OFFSET, 18U),      /*!< block one bit error detected and correct interrupt flag 2 */
    FMC_BLK_INT_FLAG_ECCCOR3  = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 24U, FMC_BLKECCCS_REG_OFFSET, 19U),      /*!< block one bit error detected and correct interrupt flag 3 */
    FMC_BLK_INT_FLAG_ECCAERR  = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 25U, FMC_BLKECCCS_REG_OFFSET, 28U),      /*!< block one bit error flag at ECC address */
    FMC_BLK_INT_FLAG_ECCCOROV = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 26U, FMC_BLKECCCS_REG_OFFSET, 29U),      /*!< block more than 4 one bit error detected interrupt flag */
    FMC_BLK_INT_FLAG_ECCEDC   = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 24U, FMC_BLKECCCS_REG_OFFSET, 30U),      /*!< block EDC after ECC checker error interrupt flag */
    FMC_BLK_INT_FLAG_ECCDET   = FMC_REGIDX_BIT2(FMC_BLKECCCS_REG_OFFSET, 25U, FMC_BLKECCCS_REG_OFFSET, 31U),      /*!< block two bit errors detect interrupt flag */
    /* interrupt flags in BUFECCCS register */
    FMC_BUF_INT_FLAG_ECCCOR0  = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 24U, FMC_BUFECCCS_REG_OFFSET, 16U),      /*!< buffer one bit error detected and correct interrupt flag 0 */
    FMC_BUF_INT_FLAG_ECCCOR1  = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 24U, FMC_BUFECCCS_REG_OFFSET, 17U),      /*!< buffer one bit error detected and correct interrupt flag 1 */
    FMC_BUF_INT_FLAG_ECCCOR2  = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 24U, FMC_BUFECCCS_REG_OFFSET, 18U),      /*!< buffer one bit error detected and correct interrupt flag 2 */
    FMC_BUF_INT_FLAG_ECCCOR3  = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 24U, FMC_BUFECCCS_REG_OFFSET, 19U),      /*!< buffer one bit error detected and correct interrupt flag 3 */
    FMC_BUF_INT_FLAG_ECCAERR  = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 25U, FMC_BUFECCCS_REG_OFFSET, 28U),      /*!< buffer one bit error flag at ECC address */
    FMC_BUF_INT_FLAG_ECCCOROV = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 26U, FMC_BUFECCCS_REG_OFFSET, 29U),      /*!< buffer more than 4 one bit error detected interrupt flag */
    FMC_BUF_INT_FLAG_ECCEDC   = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 24U, FMC_BUFECCCS_REG_OFFSET, 30U),      /*!< buffer EDC after ECC checker error interrupt flag */
    FMC_BUF_INT_FLAG_ECCDET   = FMC_REGIDX_BIT2(FMC_BUFECCCS_REG_OFFSET, 25U, FMC_BUFECCCS_REG_OFFSET, 31U),      /*!< buffer two bit errors detect interrupt flag */
    /* interrupt flags in FPBECCCS register */
    FMC_FPB_INT_FLAG_ECCCOR0  = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 24U, FMC_FPBECCCS_REG_OFFSET, 16U),      /*!< fast program buffer one bit error detected and correct interrupt flag 0 */
    FMC_FPB_INT_FLAG_ECCCOR1  = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 24U, FMC_FPBECCCS_REG_OFFSET, 17U),      /*!< fast program buffer one bit error detected and correct interrupt flag 1 */
    FMC_FPB_INT_FLAG_ECCCOR2  = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 24U, FMC_FPBECCCS_REG_OFFSET, 18U),      /*!< fast program buffer one bit error detected and correct interrupt flag 2 */
    FMC_FPB_INT_FLAG_ECCCOR3  = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 24U, FMC_FPBECCCS_REG_OFFSET, 19U),      /*!< fast program buffer one bit error detected and correct interrupt flag 3 */
    FMC_FPB_INT_FLAG_ECCAERR  = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 25U, FMC_FPBECCCS_REG_OFFSET, 28U),      /*!< fast program buffer one bit error flag at ECC address */
    FMC_FPB_INT_FLAG_ECCCOROV = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 26U, FMC_FPBECCCS_REG_OFFSET, 29U),      /*!< fast program buffer more than 4 one bit error detected interrupt flag */
    FMC_FPB_INT_FLAG_ECCEDC   = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 24U, FMC_FPBECCCS_REG_OFFSET, 30U),      /*!< fast program buffer EDC after ECC checker error interrupt flag */
    FMC_FPB_INT_FLAG_ECCDET   = FMC_REGIDX_BIT2(FMC_FPBECCCS_REG_OFFSET, 25U, FMC_FPBECCCS_REG_OFFSET, 31U)       /*!< fast program buffer two bit errors detect interrupt flag */
} fmc_ecc_interrupt_flag_enum;

