sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* unlock key x */
#define UNLOCK_KEY0(x)               ((uint32_t)(0x45670123U + (x)))                    /*!< unlock key x 0 */
#define UNLOCK_KEY1(x)               ((uint32_t)(0xCDEF89ABU + (x)))                    /*!< unlock key x 1 */

/* wait state counter value */
#define WS_WSCNT(regval)             (BITS(0,2) & ((uint32_t)(regval) << 0))
#define WS_WSCNT_0                   WS_WSCNT(0)                                        /*!< 0 wait state added */
#define WS_WSCNT_1                   WS_WSCNT(1)                                        /*!< 1 wait state added */
#define WS_WSCNT_2                   WS_WSCNT(2)                                        /*!< 2 wait state added */
#define WS_WSCNT_3                   WS_WSCNT(3)                                        /*!< 3 wait state added */
#define WS_WSCNT_4                   WS_WSCNT(4)                                        /*!< 4 wait state added */
#define WS_WSCNT_5                   WS_WSCNT(5)                                        /*!< 5 wait state added */

/* check blank command read length */
#define FMC_CBCMDLEN_2_DW            ((uint32_t)0x00000000U)                            /*!< check blank command read length is 2 double words (16 bytes) */
#define FMC_CBCMDLEN_4_DW            ((uint32_t)0x00000001U)                            /*!< check blank command read length is 4 double words (32 bytes) */
#define FMC_CBCMDLEN_8_DW            ((uint32_t)0x00000002U)                            /*!< check blank command read length is 8 double words (64 bytes) */
#define FMC_CBCMDLEN_16_DW           ((uint32_t)0x00000003U)                            /*!< check blank command read length is 16 double words (128 bytes) */
#define FMC_CBCMDLEN_32_DW           ((uint32_t)0x00000004U)                            /*!< check blank command read length is 32 double words (256 bytes) */
#define FMC_CBCMDLEN_64_DW           ((uint32_t)0x00000005U)                            /*!< check blank command read length is 64 double words (512 bytes) */
#define FMC_CBCMDLEN_128_DW          ((uint32_t)0x00000006U)                            /*!< check blank command read length is 128 double words (1024 bytes) */
#define FMC_CBCMDLEN_256_DW          ((uint32_t)0x00000007U)                            /*!< check blank command read length is 256 double words (2048 bytes) */

/* HSM bank size config */
#define HSM_BANK_SIZE_NONE           ((uint32_t)0x00000000U)                            /*!< HSM bank size is none */
#define HSM_BANK_SIZE_16K            ((uint32_t)0x00000001U)                            /*!< HSM bank size is 16K */
#define HSM_BANK_SIZE_32K            ((uint32_t)0x00000002U)                            /*!< HSM bank size is 32K */
#define HSM_BANK_SIZE_48K            ((uint32_t)0x00000003U)                            /*!< HSM bank size is 48K */
#define HSM_BANK_SIZE_64K            ((uint32_t)0x00000004U)                            /*!< HSM bank size is 64K */
#define HSM_BANK_SIZE_80K            ((uint32_t)0x00000005U)                            /*!< HSM bank size is 80K */
#define HSM_BANK_SIZE_96K            ((uint32_t)0x00000006U)                            /*!< HSM bank size is 96K */
#define HSM_BANK_SIZE_112K           ((uint32_t)0x00000007U)                            /*!< HSM bank size is 112K */
#define HSM_BANK_SIZE_128K           ((uint32_t)0x00000008U)                            /*!< HSM bank size is 128K */
#define HSM_BANK_SIZE_144K           ((uint32_t)0x00000009U)                            /*!< HSM bank size is 144K */
#define HSM_BANK_SIZE_160K           ((uint32_t)0x0000000AU)                            /*!< HSM bank size is 160K */
#define HSM_BANK_SIZE_176K           ((uint32_t)0x0000000BU)                            /*!< HSM bank size is 176K */
#define HSM_BANK_SIZE_192K           ((uint32_t)0x0000000CU)                            /*!< HSM bank size is 192K */
#define HSM_BANK_SIZE_208K           ((uint32_t)0x0000000DU)                            /*!< HSM bank size is 208K */
#define HSM_BANK_SIZE_224K           ((uint32_t)0x0000000EU)                            /*!< HSM bank size is 224K */
#define HSM_BANK_SIZE_240K           ((uint32_t)0x0000000FU)                            /*!< HSM bank size is 240K */
#define HSM_BANK_SIZE_256K           ((uint32_t)0x00000010U)                            /*!< HSM bank size is 256K */

/* the master ID */
#define CTL_MASTERID(regval)         (BITS(20,23) & ((uint32_t)(regval) << 20))
#define CTL_MASTERID_AXIM_CM7_0      CTL_MASTERID(0U)                                   /*!< AXIM_CM7_0 */
#define CTL_MASTERID_AXIM_CM7_1      CTL_MASTERID(1U)                                   /*!< AXIM_CM7_1 */
#define CTL_MASTERID_DMA0_MEM        CTL_MASTERID(2U)                                   /*!< DMA0_MEM */
#define CTL_MASTERID_DMA1_MEM        CTL_MASTERID(3U)                                   /*!< DMA1_MEM */
#define CTL_MASTERID_HSM_CM23        CTL_MASTERID(4U)                                   /*!< HSM */
#define CTL_MASTERID_ENET            CTL_MASTERID(5U)                                   /*!< ENET_CM23 */
#define CTL_MASTERID_AHBP_CM7_1      CTL_MASTERID(7U)                                   /*!< AHBP_CM7_1 */
#define CTL_MASTERID_DMA0_PERIPH     CTL_MASTERID(10U)                                  /*!< DMA0_PERIPH */
#define CTL_MASTERID_DMA1_PERIPH     CTL_MASTERID(11U)                                  /*!< DMA1_PERIPH */
#define CTL_MASTERID_HSM_DMA         CTL_MASTERID(12U)                                  /*!< HSM_DMA */
#define CTL_MASTERID_AHBP_CM7_0      CTL_MASTERID(14U)                                  /*!< AHBP_CM7_0 */

#define FMC_BLKECCCS(blockx)         REG32((FMC) + 0x60U + 0x100U * (uint32_t)(blockx)) /*!< FMC block x ECC control and status register */
#define FMC_BLKUCECCADDR(blockx)     REG32((FMC) + 0x64U + 0x100U * (uint32_t)(blockx)) /*!< FMC block x UCECC address register */
#define FMC_BLKCECCADDR0(blockx)     REG32((FMC) + 0x68U + 0x100U * (uint32_t)(blockx)) /*!< FMC block x CECC address0 register */
#define FMC_BLKCECCADDR1(blockx)     REG32((FMC) + 0x6CU + 0x100U * (uint32_t)(blockx)) /*!< FMC block x CECC address1 register */
#define FMC_BLKCECCADDR2(blockx)     REG32((FMC) + 0x70U + 0x100U * (uint32_t)(blockx)) /*!< FMC block x CECC address2 register */
#define FMC_BLKCECCADDR3(blockx)     REG32((FMC) + 0x74U + 0x100U * (uint32_t)(blockx)) /*!< FMC block x CECC address3 register */

