sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
#define FMC_BUFECCCS(bufx)           REG32((FMC) + 0x80U + 0x100U * (uint32_t)(bufx))   /*!< FMC buffer x control register */
#define FMC_BUFUCECCADDR(bufx)       REG32((FMC) + 0x84U + 0x100U * (uint32_t)(bufx))   /*!< FMC buffer x UCECC address register */
#define FMC_BUFCECCADDR0(bufx)       REG32((FMC) + 0x88U + 0x100U * (uint32_t)(bufx))   /*!< FMC buffer x correct ECC address0 register */
#define FMC_BUFCECCADDR1(bufx)       REG32((FMC) + 0x8CU + 0x100U * (uint32_t)(bufx))   /*!< FMC buffer x correct ECC address1 register */
#define FMC_BUFCECCADDR2(bufx)       REG32((FMC) + 0x90U + 0x100U * (uint32_t)(bufx))   /*!< FMC buffer x correct ECC address2 register */
#define FMC_BUFCECCADDR3(bufx)       REG32((FMC) + 0x94U + 0x100U * (uint32_t)(bufx))   /*!< FMC buffer x correct ECC address3 register */

/* option bytes security protection level in FMC_OBSTAT register */
#define OB_OBSTAT_PLEVEL_NO          ((uint8_t)0x00U)                                   /*!< no security protection */
#define OB_OBSTAT_PLEVEL_LOW         ((uint8_t)0x01U)                                   /*!< low security protection */
#define OB_OBSTAT_PLEVEL_HIGH        ((uint8_t)0x03U)                                   /*!< high security protection */

/* option bytes security protection configuration */
#define FMC_NSPC                     ((uint16_t)0x5AA5U)                                /*!< no security protection */
#define FMC_LSPC                     ((uint16_t)0x44BBU)                                /*!< low security protection, any value except 0xA5 or 0xCC */
#define FMC_HSPC                     ((uint16_t)0x33CCU)                                /*!< high security protection */

/* option bytes software/hardware free watchdog timer0 */
#define OB_FWDGT0_HW                 ((uint16_t)0x0100U)                                /*!< hardware free watchdog timer0 */
#define OB_FWDGT0_SW                 ((uint16_t)0x0001U)                                /*!< software free watchdog timer0 */

/* option bytes reset or not entering standby mode */
#define OB_STDBY_RST                 ((uint16_t)0x0400U)                                /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                ((uint16_t)0x0004U)                                /*!< no reset when entering standby mode */

/* option bytes software/hardware free watchdog timer1 */
#define OB_FWDGT1_HW                 ((uint16_t)0x2000U)                                /*!< hardware free watchdog timer1 */
#define OB_FWDGT1_SW                 ((uint16_t)0x0020U)                                /*!< software free watchdog timer1 */

/* option bytes free watchdog 0/1 stop or continue counting in standby mode */
#define OB_FWDG_STDBY_STOP           ((uint16_t)0x4000U)                                /*!< free watchdog 0/1 stop counting in standby mode */
#define OB_FWDG_STDBY_CONT           ((uint16_t)0x0040U)                                /*!< free watchdog 0/1 continue counting in standby */

/* HSM option bytes security protection configuration */
#define HSM_NSPC                     ((uint16_t)0x5AA5U)                                /*!< no security protection */
#define HSM_LSPC                     ((uint16_t)0x44BBU)                                /*!< low security protection, any value except 0xA5 or 0xCC */
#define HSM_HSPC                     ((uint16_t)0x33CCU)                                /*!< high security protection */

/* HSM option bytes security protection level in FMC_HSMOBSTAT register */
#define HSM_OBSTAT_PLEVEL_NO          ((uint8_t)0x00U)                                  /*!< no security protection */
#define HSM_OBSTAT_PLEVEL_LOW         ((uint8_t)0x01U)                                  /*!< low security protection */
#define HSM_OBSTAT_PLEVEL_HIGH        ((uint8_t)0x03U)                                  /*!< high security protection */

/* HSM option bytes swap configuration */
#define HSM_OB_SWAP_PFLASH0          ((uint16_t)0x8000U)                                /*!< bank0 and HSM bank 0 at Pflash0, bank1 and HSM bank 1 at Pflash1 */
#define HSM_OB_SWAP_PFLASH1          ((uint16_t)0x0080U)                                /*!< bank0 and HSM bank 0 at Pflash1, bank1 and HSM bank 1 at Pflash0 */

/* HSM option bytes HSM watchdog configuration */
#define HSM_OB_WWDG_HW               ((uint16_t)0x4000U)                                /*!< hardware HSM watchdog */
#define HSM_OB_WWDG_SW               ((uint16_t)0x0040U)                                /*!< software HSM watchdog */

#define BANK0_BASE_ADDRESS           ((uint32_t)0x08000000U)                            /*!< FMC bank0 base address */
#define HSM_BANK0_ADDRESS            ((uint32_t)0x08440000U)                            /*!< FMC HSM code0 address */
#define HSM_BANK0_MAX_SIZE           ((uint32_t)0x00040000U)                            /*!< FMC HSM code0 max size */
#define HSM_BANK1_ADDRESS            ((uint32_t)0x08480000U)                            /*!< FMC HSM code0 address */
#define HSM_BANK1_MAX_SIZE           ((uint32_t)0x00040000U)                            /*!< FMC HSM code0 max size */
#define HOST_DATA_BASE_ADDRESS       ((uint32_t)0x08800000U)                            /*!< FMC dflash0 base address */
#define HOST_DATA_SIZE               ((uint32_t)0x00020000U)                            /*!< FMC HOST data size */
#define HSM_DATA_BASE_ADDRESS        ((uint32_t)0x08880000U)                            /*!< FMC HSM data base address */
#define HSM_DATA_SIZE                ((uint32_t)0x00018000U)                            /*!< FMC HSM data size */
#define SBAF_BASE_ADDRESS            ((uint32_t)0x08400000U)                            /*!< FMC sBAF base address */
#define SBAF_SIZE                    ((uint32_t)0x00008000U)                            /*!< FMC sBAF size */

#define OTP_BASE_ADDRESS             ((uint32_t)0x1FFF7000U)                            /*!< FMC OTP base address */
#define OTP_SIZE                     ((uint32_t)0x00000800U)                            /*!< FMC OTP size */
#define HSM_OTP_BASE_ADDRESS         ((uint32_t)0x1FFFF900U)                            /*!< FMC HSM OTP base address */
#define HSM_OTP_SIZE                 ((uint32_t)0x000000E8U)                            /*!< FMC HSM OTP size */

#define OB_WORD_CNT                  ((uint8_t)0x0EU)                                   /*!< word count of HOST option bytes */
#define OB_DOUBLEWORD_CNT            ((uint8_t)0x07U)                                   /*!< double-word count of HOST option bytes */
#define HSM_OB_WORD_CNT              ((uint8_t)0x02U)                                   /*!< word count of HSM option bytes */
#define HSM_OB_DOUBLEWORD_CNT        ((uint8_t)0x01U)                                   /*!< double-word count of HSM option bytes */

#define FMC_TIMEOUT_COUNT            ((uint32_t)0xFFFF0000U)                            /*!< count to judge of FMC timeout */
#define DOUBLEWORD_CNT_IN_ROW        ((uint8_t)0x40U)                                   /*!< double-word count in one row data */
#define CBCMDLEN_OF_ONE_ROW          ((uint8_t)0x05U)                                   /*!< CBCMD read length of one row data */

/* LC address definition */
#define LC_MARKED                    ((uint64_t)0x55AA50AF55AA50AFU)                    /*!< LC marked value */
#define LC_ERASED                    ((uint64_t)0xFFFFFFFFFFFFFFFFU)                    /*!< LC erased value */
#define LC_SLOT_SIZE                 ((uint32_t)0x0000000FU)                            /*!< FMC HSM OTP size */
#define LC_SLOT0_BASE_ADDRESS        ((uint32_t)0x1FFFF900U)                            /*!< FMC LC slot0 base address */
#define LC_SLOT1_BASE_ADDRESS        ((uint32_t)0x1FFFF910U)                            /*!< FMC LC slot1 base address */
#define LC_SLOT2_BASE_ADDRESS        ((uint32_t)0x1FFFF920U)                            /*!< FMC LC slot2 base address */
#define LC_SLOT3_BASE_ADDRESS        ((uint32_t)0x1FFFF930U)                            /*!< FMC LC slot3 base address */
#define LC_SLOT4_BASE_ADDRESS        ((uint32_t)0x1FFFF940U)                            /*!< FMC LC slot4 base address */
#define LC_IN_FIELD_RECOVER_MODE     ((uint32_t)0x1FFFF950U)                            /*!< FMC LC IN_FIELD_RECOVER_MODE base address */

