sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* APP DBG */
#define HOST_DBG_DISABLE_ADDRESS     ((uint32_t)0x1FFFF958U)                            /*!< HOST dbg base address */
#define HSM_DBG_DISABLE_ADDRESS      ((uint32_t)0x1FFFF960U)                            /*!< HSM dbg base address */

/* HOST/HSM password address definition */
#define HOST_DBG_PASSWORD_ADDRESS    ((uint32_t)0x1FFFF968U)                            /*!< HOST password base address */
#define HSM_DBG_PASSWORD_ADDRESS     ((uint32_t)0x1FFFF978U)                            /*!< HSM password base address */

/* CRYP key address definition */
#define CRYP_KEY1_BASE_ADDRESS       ((uint32_t)0x1FFFF988U)                            /*!< FMC CRYP KEY1 base address */
#define CRYP_KEY2_BASE_ADDRESS       ((uint32_t)0x1FFFF9A8U)                            /*!< FMC CRYP KEY2 base address */

/* SPC key address definition */
#define SPC_KEY_BASE_ADDRESS         ((uint32_t)0x1FFFF9C8U)                            /*!< SPC key base address */

/* HSM SIZE address */
#define HSM_SIZE_ADDRESS             ((uint32_t)0x1FFFF9D8U)                            /*!< HSM SIZE base address */

/* HSM SEC address */
#define HSM_SEC_ADDRESS              ((uint32_t)0x1FFFF9E0U)                            /*!< HSM SEC base address */

/*!< HOST option bytes user bits */
#define FMC_OBSTAT_USER              BITS(8,15)                                         /*!< HOST option bytes user bits */

/*!< HOST option bytes cltcfg bits */
#define FMC_OB_CLTCFG_RSTPIN_MOD         BIT(0)                                         /*!< reset pin mode */
#define FMC_OB_CLTCFG_FFIOMOD            BIT(1)                                         /*!< configuration of the fatal fault pins mode */
#define FMC_OB_CLTCFG_PWDGEN             BIT(7)                                         /*!< POR watchdog enable */
#define FMC_OB_CLTCFG_FMU_REA_FAIL_UEN   BIT(11)                                        /*!< FMU react failed upgrade enable */
#define FMC_OB_CLTCFG_STCM_REC_FAIL_UEN  BIT(12)                                        /*!< STCM recover failed upgrade enable */
#define FMC_OB_CLTCFG_RCTL_SUBSRU_UEN    BIT(14)                                        /*!< subsystem reset upgrade enable */
#define FMC_OB_CLTCFG_LOHRST_UEN         BIT(16)                                        /*!< loss of HXTAL error upgrade enable */
#define FMC_OB_CLTCFG_LOPRST_UEN         BIT(17)                                        /*!< loss of PLL error upgrade enable */
#define FMC_OB_CLTCFG_HSM_SYS_RST_UEN    BIT(26)                                        /*!< HSM system reset detection upgrade enable */
#define FMC_OB_CLTCFG_SW_SYS_RST_UEN     BIT(37)                                        /*!< software system reset upgrade enable */
#define FMC_OB_CLTCFG_DBG_SYS_RST_UEN    BIT(38)                                        /*!< debug system reset upgrade enable */

/*!< ECCCORx clear bit  */
#define FMC_ECCCOR_CLEAR                 BIT(20)                                        /*!< ECCCORx clear bit */
#define FMC_PID_0                        (0U)                                           /*!< PID0 index */
#define FMC_PID_1                        (1U)                                           /*!< PID1 index */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check wait state counter value */
#define NOT_FMC_WS_WSCNT(wscnt)                                 (((wscnt) != WS_WSCNT_0) && ((wscnt) != WS_WSCNT_1) && \
                                                                 ((wscnt) != WS_WSCNT_2) && ((wscnt) != WS_WSCNT_3) && \
                                                                 ((wscnt) != WS_WSCNT_4) && ((wscnt) != WS_WSCNT_5))
/* check buffer number index */
#if defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_FMC_BUFFER_INDEX(index)                             (((index) != FMC_BUFF_0) && ((index) != FMC_BUFF_1) && \
                                                                 ((index) != FMC_BUFF_2) && ((index) != FMC_BUFF_3))
#else
#define NOT_FMC_BUFFER_INDEX(index)                             (((index) != FMC_BUFF_0) && ((index) != FMC_BUFF_2) && \
                                                                 ((index) != FMC_BUFF_3))
#endif /* defined (GD32A72XX) || defined (GD32A74XX) */
/* check interface 0 address */
#define NOT_FMC_VALID_INTERFACE0_ADDRESS(address)               (((address) < 0x08000000U) || (((address) < 0X08440000U) && (address) > 0x08400000U) || \
                                                                 (((address) < 0x08800000U) && (address) > 0x084BFFFFU) || ((address) > 0x0881FFFFU))
/* check interface 0 OPT address */
#define NOT_FMC_VALID_INTERFACE0_OTP_ADDRESS(address)           ((((address) < 0x1FFF7000U) || (address) > 0x1FFF77FFU))

/* check check blank address configuration */
#define NOT_FMC_VALID_BLANK_ADDRESS_CONFIG(address, length)     ((((address)%0x800U) + (((uint32_t)1U << ((length) + 4U)))) > 0x800U)
/* check HOST flash area */
#define NOT_FMC_HOST_AREA(area)                                 (((area) != BANK0_AREA) && ((area) != BANK1_AREA) && \
                                                                 ((area) != DATA_FLASH_AREA))
/* check interface 1 OPT address */
#define NOT_FMC_VALID_INTERFACE1_OTP_ADDRESS(address)           ((((address) < 0x1FFFF900U) || (address) > 0x1FFFF9E7U))
/* check interface 1 data flash address */
#define NOT_FMC_VALID_INTERFACE1_DATA_FLASH_ADDRESS(address)    ((((address) < 0x08880000U) || (address) > 0x08897FFFU))
/* check LC slot address */
#define NOT_FMC_LC_SLOT_ADDRESS(address)                        (((address) != LC_SLOT0_BASE_ADDRESS) && ((address) != LC_SLOT1_BASE_ADDRESS) && \
                                                                 ((address) != LC_SLOT2_BASE_ADDRESS) && ((address) != LC_SLOT3_BASE_ADDRESS) && \
                                                                 ((address) != LC_SLOT4_BASE_ADDRESS) && ((address) != LC_IN_FIELD_RECOVER_MODE))
/* check debug password address */
#define NOT_FMC_DBG_PASSWORD_ADDRESS(address)                   (((address) != HOST_DBG_PASSWORD_ADDRESS) && ((address) != HSM_DBG_PASSWORD_ADDRESS))
/* check HSM cryp key address */
#define NOT_FMC_CRYP_KEY_ADDRESS(address)                       (((address) != CRYP_KEY1_BASE_ADDRESS) && ((address) != CRYP_KEY2_BASE_ADDRESS))
/* check HSM cryp key address */
#define NOT_FMC_HSM_BANK_SIZE(hsm_size)                         (((hsm_size) > 0x10U))
/* check security protection value */
#define NOT_FMC_SPC_VALUE(ob_spc)                               (((ob_spc) != FMC_NSPC) && ((ob_spc) != FMC_LSPC) && ((ob_spc) != FMC_HSPC))
/* check HSM flash area */
#define NOT_FMC_HSM_AREA(area)                                  (((area) != HSM_BANK_AREA) && ((area) != HSM_DATA_AREA))
/* check HSM security protection value */
#define NOT_FMC_HSM_SPC_VALUE(ob_hsmspc)                        (((ob_hsmspc) != HSM_NSPC) && ((ob_hsmspc) != HSM_LSPC) && ((ob_hsmspc) != HSM_HSPC))
/* check HSM SWAP option bytes */
#define NOT_FMC_HSM_SWAP_VALUE(hsmob_swap)                      (((hsmob_swap) != HSM_OB_SWAP_PFLASH0) && ((hsmob_swap) != HSM_OB_SWAP_PFLASH1))
/* check HSM window watchdog option bytes */
#define NOT_FMC_HSM_WWDG_VALUE(hsmob_wwdg)                      (((hsmob_wwdg) != HSM_OB_WWDG_HW) && ((hsmob_wwdg) != HSM_OB_WWDG_SW))
/* check HSM HSMUSER option bytes */
#define FMC_HSM_HSMUSER_VALUE_HIGH                               (0x3FU)
#define NOT_FMC_HSM_HSMUSER_VALUE(hsmob_user)                    (FMC_HSM_HSMUSER_VALUE_HIGH < (hsmob_user))
/* check FMC flag */
#define NOT_FMC_FLAG(flag)                                      (((flag) != FMC_STAT0_FLAG_BUSY)      && ((flag) != FMC_STAT0_FLAG_PGSERR) && \
                                                                 ((flag) != FMC_STAT0_FLAG_PGERR)     && ((flag) != FMC_STAT0_FLAG_WPERR) && \
                                                                 ((flag) != FMC_STAT0_FLAG_END)       && ((flag) != FMC_STAT0_FLAG_CBCMDERR) && \
                                                                 ((flag) != FMC_STAT0_FLAG_LOADECCERR) && ((flag) != FMC_STAT0_FLAG_COMPERR) && \
                                                                 ((flag) != FMC_STAT0_FLAG_TMRERR)    && ((flag) != FMC_STAT0_FLAG_RSTERR) && \
                                                                 ((flag) != FMC_STAT1_FLAG_BUSY)      && ((flag) != FMC_STAT1_FLAG_PGSERR) && \
                                                                 ((flag) != FMC_STAT1_FLAG_PGERR)     && ((flag) != FMC_STAT1_FLAG_WPERR) && \
                                                                 ((flag) != FMC_STAT1_FLAG_END)       && ((flag) != FMC_STAT1_FLAG_CBCMDERR) && \
                                                                 ((flag) != FMC_STAT1_FLAG_TMRERR)    && ((flag) != FMC_STAT1_FLAG_RSTERR) && \
                                                                 ((flag) != FMC_FLAG_OBERR)           && ((flag) != FMC_FLAG_HSMOBERR))
/* check FMC clear flag */
#define NOT_FMC_CLEAR_FLAG(flag)                                 (((flag) != FMC_STAT0_FLAG_PGSERR)   && ((flag) != FMC_STAT0_FLAG_PGERR) && \
                                                                  ((flag) != FMC_STAT0_FLAG_WPERR)    && ((flag) != FMC_STAT0_FLAG_END) && \
                                                                  ((flag) != FMC_STAT0_FLAG_CBCMDERR) && ((flag) != FMC_STAT0_FLAG_LOADECCERR) && \
                                                                  ((flag) != FMC_STAT0_FLAG_COMPERR)  && ((flag) != FMC_STAT0_FLAG_RSTERR)&& \
                                                                  ((flag) != FMC_STAT1_FLAG_PGSERR)   && ((flag) != FMC_STAT1_FLAG_PGERR) && \
                                                                  ((flag) != FMC_STAT1_FLAG_WPERR)    && ((flag) != FMC_STAT1_FLAG_END) && \
                                                                  ((flag) != FMC_STAT1_FLAG_CBCMDERR) && ((flag) != FMC_STAT1_FLAG_RSTERR))
/* check FMC interrupt */
#define NOT_FMC_INT(interrupt)                                   (((interrupt) != FMC_CTL0_INT_ERR) && ((interrupt) != FMC_CTL0_INT_END) && \
                                                                  ((interrupt) != FMC_CTL1_INT_ERR) && ((interrupt) != FMC_CTL1_INT_END))
/* check FMC interrupt flag */
#define NOT_FMC_INT_FLAG(int_flag)                               (((int_flag) != FMC_STAT0_INT_FLAG_PGSERR)   && ((int_flag) != FMC_STAT0_INT_FLAG_PGERR) && \
                                                                  ((int_flag) != FMC_STAT0_INT_FLAG_WPERR)    && ((int_flag) != FMC_STAT0_INT_FLAG_END) && \
                                                                  ((int_flag) != FMC_STAT0_INT_FLAG_CBCMDERR) && ((int_flag) != FMC_STAT0_INT_FLAG_RSTERR) && \
                                                                  ((int_flag) != FMC_STAT1_INT_FLAG_PGSERR)   && ((int_flag) != FMC_STAT1_INT_FLAG_PGERR) && \
                                                                  ((int_flag) != FMC_STAT1_INT_FLAG_WPERR)    && ((int_flag) != FMC_STAT1_INT_FLAG_END) && \
                                                                  ((int_flag) != FMC_STAT1_INT_FLAG_CBCMDERR) && ((int_flag) != FMC_STAT1_INT_FLAG_RSTERR))

/* check FMC interrupt clear flag */
#define NOT_FMC_INT_CLEAR_FLAG(int_flag)                          (((int_flag) != FMC_STAT0_INT_FLAG_PGSERR)  && ((int_flag) != FMC_STAT0_INT_FLAG_PGERR) && \
                                                                   ((int_flag) != FMC_STAT0_INT_FLAG_WPERR)    && ((int_flag) != FMC_STAT0_INT_FLAG_END) && \
                                                                   ((int_flag) != FMC_STAT0_INT_FLAG_CBCMDERR) && ((int_flag) != FMC_STAT0_INT_FLAG_COMPERR) && \
                                                                   ((int_flag) != FMC_STAT0_INT_FLAG_RSTERR)   && ((int_flag) != FMC_STAT1_INT_FLAG_PGSERR) && \
                                                                   ((int_flag) != FMC_STAT1_INT_FLAG_PGERR)    && ((int_flag) != FMC_STAT1_INT_FLAG_WPERR) && \
                                                                   ((int_flag) != FMC_STAT1_INT_FLAG_END)      && ((int_flag) != FMC_STAT1_INT_FLAG_CBCMDERR) && \
                                                                   ((int_flag) != FMC_STAT1_INT_FLAG_RSTERR))

/* check FMC ECC flag */
#define NOT_FMC_ECC_FLAG(ecc_flag)                               (((ecc_flag) != FMC_BLKFLAG_ECCCOR0)  && ((ecc_flag) != FMC_BLKFLAG_ECCCOR1) && \
                                                                  ((ecc_flag) != FMC_BLKFLAG_ECCCOR2)  && ((ecc_flag) != FMC_BLKFLAG_ECCCOR3) && \
                                                                  ((ecc_flag) != FMC_BLKFLAG_ECCAERR)  && ((ecc_flag) != FMC_BLKFLAG_ECCCOROV) && \
                                                                  ((ecc_flag) != FMC_BLKFLAG_ECCEDC)   && ((ecc_flag) != FMC_BLKFLAG_ECCDET) && \
                                                                  ((ecc_flag) != FMC_BUFFLAG_ECCCOR0)  && ((ecc_flag) != FMC_BUFFLAG_ECCCOR1) && \
                                                                  ((ecc_flag) != FMC_BUFFLAG_ECCCOR2)  && ((ecc_flag) != FMC_BUFFLAG_ECCCOR3) && \
                                                                  ((ecc_flag) != FMC_BUFFLAG_ECCAERR)  && ((ecc_flag) != FMC_BUFFLAG_ECCCOROV) && \
                                                                  ((ecc_flag) != FMC_BUFFLAG_ECCEDC)   && ((ecc_flag) != FMC_BUFFLAG_ECCDET) && \
                                                                  ((ecc_flag) != FMC_FPBFLAG_ECCCOR0)  && ((ecc_flag) != FMC_FPBFLAG_ECCCOR1) && \
                                                                  ((ecc_flag) != FMC_FPBFLAG_ECCCOR2)  && ((ecc_flag) != FMC_FPBFLAG_ECCCOR3) && \
                                                                  ((ecc_flag) != FMC_FPBFLAG_ECCAERR)  && ((ecc_flag) != FMC_FPBFLAG_ECCCOROV) && \
                                                                  ((ecc_flag) != FMC_FPBFLAG_ECCEDC)   &&((ecc_flag) != FMC_FPBFLAG_ECCDET))

