sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* check FMC register number flag */
#define NOT_FMC_REG_NUM(reg_num)                                  (((reg_num) != FMC_REG_0) && ((reg_num) != FMC_REG_1) && \
                                                                   ((reg_num) != FMC_REG_2) && ((reg_num) != FMC_REG_3))
/* check FMC ECC interrupt */
#define NOT_FMC_ECC_INT(interrupt)                                (((interrupt) != FMC_BLK_INT_ECCCOR)  && ((interrupt) != FMC_BLK_INT_ECCDET) && \
                                                                   ((interrupt) != FMC_BLK_INT_ECCCORV) && ((interrupt) != FMC_BUF_INT_ECCCOR) && \
                                                                   ((interrupt) != FMC_BUF_INT_ECCDET)  && ((interrupt) != FMC_BUF_INT_ECCCORV) && \
                                                                   ((interrupt) != FMC_FPB_INT_ECCCOR) && ((interrupt) != FMC_FPB_INT_ECCDET)  && \
                                                                   ((interrupt) != FMC_FPB_INT_ECCCORV))
/* check FMC ECC interrupt flag */
#define NOT_FMC_ECC_INT_FLAG(ecc_int_flag)                        (((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCCOR0)  && ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCCOR1) && \
                                                                   ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCCOR2)  && ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCCOR3) && \
                                                                   ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCAERR)  && ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCCOROV) && \
                                                                   ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCEDC)   && ((ecc_int_flag) != FMC_BLK_INT_FLAG_ECCDET) && \
                                                                   ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCCOR0)  && ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCCOR1) && \
                                                                   ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCCOR2)  && ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCCOR3) && \
                                                                   ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCAERR)  && ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCCOROV) && \
                                                                   ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCEDC)   && ((ecc_int_flag) != FMC_BUF_INT_FLAG_ECCDET) && \
                                                                   ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCCOR0)  && ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCCOR1) && \
                                                                   ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCCOR2)  && ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCCOR3) && \
                                                                   ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCAERR)  && ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCCOROV) && \
                                                                   ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCEDC)   && ((ecc_int_flag) != FMC_FPB_INT_FLAG_ECCDET))
/* check FMC correctable ECC address  */
#define NOT_CECC_ADDR(cecc_addr)                                  (((cecc_addr) != CECC_ADDR0) && ((cecc_addr) != CECC_ADDR1) && \
                                                                   ((cecc_addr) != CECC_ADDR2) && ((cecc_addr) != CECC_ADDR3))
/* check FMC PID index */
#define NOT_FMC_PID_INDEX(pidx)                                   (((pidx) != FMC_PID_0) && ((pidx) != FMC_PID_1))
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* FMC programming functions */
/* unlock the control register 0/1 operation */
void fmc_unlock(void);
/* unlock the control register 0 operation */
void fmc_ctl0_unlock(void);
/* unlock the control register 1 operation */
void fmc_ctl1_unlock(void);
/* lock the control register 0/1 operation */
void fmc_lock(void);
/* lock the control register 0 operation */
void fmc_ctl0_lock(void);
/* lock the control register 1 operation */
void fmc_ctl1_lock(void);

/* set the wait state counter value */
void fmc_wscnt_set(uint8_t wscnt);
/* enable buffer x */
void fmc_buffer_enable(fmc_buff_enum index);
/* disable buffer x */
void fmc_buffer_disable(fmc_buff_enum index);
/* enable buffer x read code buffers */
void fmc_code_current_buffer_enable(fmc_buff_enum index);
/* disable buffer x read code buffers */
void fmc_code_current_buffer_disable(fmc_buff_enum index);
/* enable buffer x read data buffers */
void fmc_data_current_buffer_enable(fmc_buff_enum index);
/* disable buffer x read data buffers */
void fmc_data_current_buffer_disable(fmc_buff_enum index);
/* enable buffer x code prefetch */
void fmc_code_prefetch_buffer_enable(fmc_buff_enum index);
/* disable buffer x code prefetch */
void fmc_code_prefetch_buffer_disable(fmc_buff_enum index);
/* enable buffer x data prefetch */
void fmc_data_prefetch_buffer_enable(fmc_buff_enum index);
/* disable buffer x data prefetch */
void fmc_data_prefetch_buffer_disable(fmc_buff_enum index);

/* FMC HOST */
/* check whether area in bank0/bank1/data flash page is blank or not by check blank command */
fmc_state_enum fmc_blank_check(uint32_t address, uint8_t length);
/* get base address of bank0 */
uint32_t fmc_bank0_base_address_get(void);
/* get base address of bank1 */
uint32_t fmc_bank1_base_address_get(void);
/* erase bank0/bank1/data flash page */
fmc_state_enum fmc_page_erase(uint32_t page_address);
/* mass erase bank0/bank1/data flash */
fmc_state_enum fmc_mass_erase(fmc_area_enum area);
/* program a double word at the corresponding address in bank0 / bank1 / data flash */
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data);
/* fast program one row data (64 double-word) starting at the corresponding address in bank0 / bank1 / data flash */
fmc_state_enum fmc_fast_program(uint32_t address, uint64_t data[]);
/* program a double word at the corresponding address in OTP */
fmc_state_enum fmc_otp_doubleword_program(uint32_t address, uint64_t data);
/* bank0 / bank1 size get */
uint32_t fmc_bank_size_get(void);

/* FMC HSM */
/* check whether area in HSM data flash page is blank or not by check blank command */
fmc_state_enum fmc_hsm_data_blank_check(uint32_t address, uint8_t length);
/* get base address of HSM bank 0 */
uint32_t fmc_hsm_bank0_address_get(void);
/* get base address of HSM bank 1 */
uint32_t fmc_hsm_bank1_address_get(void);
/* erase HSM bank page */
fmc_state_enum fmc_hsm_bank_page_erase(uint32_t page_address);
/* program a double word at the corresponding address in HSM bank0 / bank1 flash */
fmc_state_enum fmc_hsm_bank_doubleword_program(uint32_t address, uint64_t data);
/* fast program one row data (64 double-word) starting at the corresponding address in HSM bank0 / bank1 flash */
fmc_state_enum fmc_hsm_bank_fast_program(uint32_t address, uint64_t data[]);
/* HSM erase data flash page */
fmc_state_enum fmc_hsm_data_page_erase(uint32_t page_address);
/* program a double word at the corresponding address in HSM data flash */
fmc_state_enum fmc_hsm_data_doubleword_program(uint32_t address, uint64_t data);
/* HSM fast program one row data (64 double-word) starting at the corresponding address */
fmc_state_enum fmc_hsm_data_fast_program(uint32_t address, uint64_t data[]);
/* program a double word at the corresponding address in HSM OTP */
fmc_state_enum hsm_otp_doubleword_program(uint32_t address, uint64_t data);
/* HSM system mark LC slot valid field */
fmc_state_enum hsm_lc_valid_mark(uint32_t address);
/* HSM system mark LC slot invalid field */
fmc_state_enum hsm_lc_invalid_mark(uint32_t address);
/* HOST dbg disable */
fmc_state_enum hsm_host_dbg_disable(void);
/* HSM dbg disable */
fmc_state_enum hsm_hsm_dbg_disable(void);
/* HOST / HSM debug password configuration in HSM OTP */
fmc_state_enum hsm_debug_password_config(uint32_t address, uint64_t data[]);
/* HSM cryp key configuration in HSM OTP */
fmc_state_enum hsm_cryp_key_config(uint32_t address, uint64_t data[]);
/* HSM SPC key configuration in HSM OTP */
fmc_state_enum hsm_spc_key_config(uint64_t data[]);
/* unlock SPC protection with SPC key */
void spc_unlock(uint32_t key[]);
/* configure HSM bank0 / bank1 size */
fmc_state_enum hsm_bank_size_config(uint64_t hsm_size);
/* HSM security enable */
fmc_state_enum hsm_sec_enable(void);
/* HSM factory test mode disable */
fmc_state_enum hsm_factory_disable(void);
/* HSM bank0 / bank1 size get */
uint32_t hsm_bank_size_get(void);

