sorosaulong-ux/gd32-test-project/Library/gd32a7xx_fmc.h
/* FMC option bytes functions */
/* force to reload the HOST and HSM option bytes */
void ob_reset(void);
/* erase the HOST option bytes */
fmc_state_enum ob_erase(void);
/* configure HOST option bytes write protection */
fmc_state_enum ob_write_protection_config(fmc_area_enum wp_area, uint32_t ob_wp);
/* configure HOST system security protection */
fmc_state_enum ob_security_protection_config(uint16_t ob_spc);
/* program the user HOST option bytes */
fmc_state_enum ob_user_write(uint16_t ob_user);
/* program the data HOST option bytes */
fmc_state_enum ob_data_program(uint16_t ob_data);
/* program the cltcfg HOST option bytes */
fmc_state_enum ob_cltcfg_config(uint64_t ob_cltcfg);
/* get the value of FMC option bytes OB_USER in FMC_OBSTAT register */
uint8_t ob_user_get(void);
/* get the value of FMC option bytes OB_DATA in FMC_OBSTAT register */
uint16_t ob_data_get(void);
/* get the value of FMC option bytes BK0WP in FMC_WP0 register */
uint32_t ob_bk0_write_protection_get(void);
/* get the value of FMC option bytes BK1WP in FMC_WP1 register */
uint32_t ob_bk1_write_protection_get(void);
/* get the value of FMC option bytes DFWP in FMC_WP2 register */
uint8_t ob_df_write_protection_get(void);
/* get the value of FMC option bytes security protection level (PLEVEL) in FMC_OBSTAT register */
uint8_t ob_plevel_get(void);

/* FMC HSM option bytes functions */
/* erase the HSM option bytes */
fmc_state_enum hsm_ob_erase(void);
/* initialize the hsm option bytes parameters struct with the default values */
void hsm_ob_para_struct_init(fmc_hsm_opt_parameter_struct *init_struct);
/* configure HSM option bytes */
fmc_state_enum hsm_ob_config(fmc_hsm_opt_parameter_struct *hsmob);
/* configure HSM option bytes write protection */
fmc_state_enum hsm_ob_write_protection_config(fmc_area_enum wp_area, uint8_t ob_hsmwp);
/* configure security protection in HSM option bytes */
fmc_state_enum hsm_ob_security_protection_config(uint16_t ob_hsmspc);
/* configure swap in HSM option bytes */
fmc_state_enum hsm_ob_swap_config(uint16_t hsmob_swap);
/* configure window watchdog in HSM option bytes */
fmc_state_enum hsm_ob_wwdg_config(uint16_t hsmob_wwdg);
/* program the user data in HSM option bytes */
fmc_state_enum hsm_ob_user_write(uint8_t hsmob_user);
/* get the value of FMC HSM option bytes HSMPFWP in FMC_HSMWP register */
uint8_t hsm_ob_pflash_write_protection_get(void);
/* get the value of FMC HSM option bytes HSMDFWP in FMC_HSMWP register */
uint8_t hsm_ob_df_write_protection_get(void);
/* get the value of HSM option bytes security protection level in FMC_HSMOBSTAT register */
uint8_t hsm_ob_spc_get(void);
/* get the value of HSM option bytes BSWAP in FMC_HSMOBSTAT register */
uint8_t hsm_ob_swap_get(void);

/* interrupt & flag functions */
/* get FMC flag status */
FlagStatus fmc_flag_get(fmc_flag_enum flag);
/* clear FMC flag status */
void fmc_flag_clear(fmc_flag_enum flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(fmc_interrupt_enum interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(fmc_interrupt_enum interrupt);
/* get FMC interrupt flag status */
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag);
/* clear FMC interrupt flag status */
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum int_flag);

/* ECC interrupt & flag functions */
/* get FMC ECC flag status */
FlagStatus fmc_ecc_flag_get(fmc_ecc_flag_enum flag, fmc_register_enum reg_num);
/* clear FMC ECC flag status */
void fmc_ecc_flag_clear(fmc_ecc_flag_enum flag, fmc_register_enum reg_num);
/* enable FMC ECC interrupt */
void fmc_ecc_interrupt_enable(fmc_ecc_interrupt_enum interrupt, fmc_register_enum reg_num);
/* disable FMC ECC interrupt */
void fmc_ecc_interrupt_disable(fmc_ecc_interrupt_enum interrupt, fmc_register_enum reg_num);
/* get FMC ECC interrupt flag status */
FlagStatus fmc_ecc_interrupt_flag_get(fmc_ecc_interrupt_flag_enum int_flag, fmc_register_enum reg_num);
/* clear FMC ECC interrupt flag status */
void fmc_ecc_interrupt_flag_clear(fmc_ecc_interrupt_flag_enum int_flag, fmc_register_enum reg_num);
/* get FMC block correctable ecc error address */
uint32_t fmc_block_cecc_address_get(fmc_register_enum reg_num, fmc_cecc_addr_enum address_idx);
/* get FMC block uncorrectable ecc error address */
uint32_t fmc_block_ucecc_address_get(fmc_register_enum reg_num);
/* get FMC buffer correctable ecc error address */
uint32_t fmc_buffer_cecc_address_get(fmc_register_enum reg_num, fmc_cecc_addr_enum address_idx);
/* get FMC buffer uncorrectable ecc error address */
uint32_t fmc_buffer_ucecc_address_get(fmc_register_enum reg_num);
/* get FMC fast program buffer correctable ecc error address */
uint32_t fmc_fpb_cecc_address_get(fmc_cecc_addr_enum address_idx);
/* get FMC fast program buffer uncorrectable ecc error address */
uint32_t fmc_fpb_ucecc_address_get(void);
/* get PID */
uint32_t fmc_pid_get(uint32_t pidx);

#endif /* GD32A7XX_FMC_H */
